/**
 * Некая сеть фастфуда предлагает несколько видов гамбургеров
 * Маленький (50 рублей, 20 калорий).
 * Большой (100 рублей, 40 калорий).
 */
export const size = [
    {
        title: "Маленький",
        name: "small",
        price: 50,
        call: 20
    },
    {
        title: "Большой",
        name: "big",
        price: 100,
        call: 40
    }
]

/**
 * Дополнительно гамбургер можно посыпать приправой (+15 рублей, +0 калорий) и
 * полить майонезом (+20 рублей, +5 калорий).
 */
export const addons = [
    {
        title: "Приправа",
        name: "condiment",
        price: 15,
        call: 0
    },
    {
        title: "Майонез",
        name: "mayo",
        price: 20,
        call: 5
    }
]

/**
 * С сыром (+10 рублей, +20 калорий).
 * С салатом (+20 рублей, +5 калорий).
 * С картофелем (+15 рублей, +10 калорий)
 */
export const filling = [
    {
        title: "Сыр",
        name: "cheese",
        price: 10,
        call: 20
    },
    {
        title: "Салат",
        name: "salad",
        price: 20,
        call: 5
    },
    {
        title: "Картофель",
        name: "potatoes",
        price: 15,
        call: 10
    }
]
